{
  "version": "4.4.0",
  "1.0.1": [
    "# Nuevo item:",
    "Premium Dye",
    "\n# Transfer:",
    "Se corrigió un error que bloqueaba por completo el comando para transferir esencia.",
    "\n# Disable:",
    "Se corrigió un error que bloqueaba por completo este comando.",
    "\n# Enable:",
    "Se corrigió un error que bloqueaba por completo este comando."
  ],
  "1.0.2": [
    "# Changelog:",
    "Se agregó un nuevo comando para ver las nuevas actualizaciones.",
    "\n# Sugerencias:",
    "Ahora es posible enviar y recibir sugerencias para sus sevidores mediante la bot.",
    "\n# Nuevos comandos lewd:",
    "danbooru, e621, gelbooru, konachan, rule34, safebooru, yandere",
    "\n# Play:",
    "Se arregló un error que se producía al realizar búsquedas con ciertos caracteres.",
    "\n# Bass Boost:",
    "Nuevo comando para potenciar los bajos del reproductor de música.",
    "\n# Settings:",
    "Se arregló un error interno al consultar la api de los webhooks (Agano).",
    "\n# Imágenes:",
    "Se añadieron nuevos gifs para los comandos de acciones y reacciones (role-play).",
    "\n# Profile:",
    "Mejora visual para los perfiles y ranking global."
  ],
  "1.0.3": [
    "# Say:",
    "Ya no es posible elegir el canal donde se enviará el mensaje.",
    "La elección del canal detonaba una serie de errores y conflictos con permisos.",
    "\n# Clubs:",
    "Los comandos de clubs ahora pertenecen a su propia categoría.",
    "\n# Welcome y Goodbye:",
    "Se dividieron los comandos en dos: channel y msg.",
    "Ya que cada comando cumple su función, ahora es más fácil configurar el módulo.",
    "\n# Help:",
    "Mejora estética del comando.",
    "\n# PAvatar:",
    "Comando removido.",
    "Algunos avatares presentaban contenido lewd."
  ],
  "1.0.4": [
    "# Nuevos comandos lewd:",
    "boobjob, happyend, lewdkitsune",
    "\n# Nuevos comandos de acciones y reacciones",
    "spray, vomit",
    "\n# Imágenes:",
    "Nekos.life ha sido reemplazada por Tanikaze, la nueva API interna de imágenes.",
    "Se eliminaron gifs que ya no existen en los comandos: crimson, rero y zawarudo.",
    "\n# Interno:",
    "Se ordenaron, optimizaron y actualizaron multiples comandos."
  ],
  "1.0.5": [
    "# Corrección de errores:",
    "1. Ahora se muestra un aviso si no se ingresa un tag en los comandos:",
    "​ ​ ​ danbooru, e621, gelbooru, konachan, rule34, safebooru, lewdere",
    "2. Trivia game vuelve a estar operativo.",
    "3. Delet this vuelve a estar operativo.",
    "4. Puppy y Kitty ahora funcionan mucho más rápido.",
    "\n# Nuevos comandos:",
    "1. El comando lewd Yandere ha sido renombrado como Lewdere.",
    "2. Se añadió un nuevo comando de reacción: Yandere",
    "3. Se añadió un nuevo comando de reacción: Psycho",
    "\n# Mejoras:",
    "Se añadió un texto descriptivo a los comandos de reacción."
  ],
  "1.0.6": [
    "# Corrección de errores:",
    "1. La bot no respondía si no podía encontrar al invocador con el comando Summoner.",
    "2. Autolewd no eliminaba los webhooks cuando la bot era expulsada del servidor.",
    "3. Los reportes a través del comando BugReport no se estaban recibiendo.",
    "\n# Votos:",
    "1. Se añadió un comando para votar por la bot.",
    "2. Ahora los comandos NSFW son exclusivos para quienes apoyen a la bot.",
    "\n# Ecomonía:",
    "1. El módulo de economía ha recibido un nuevo comando para minar diamantes.",
    "2. Nuevos items en la tienda: Pickaxe, Rareaxe, Spectral."
  ],
  "1.0.7": [
    "# Corrección de errores:",
    "1. Se corrigió un error interno con el spawn de lootboxes.",
    "2. Posible corrección al error \"AbortError: The user aborted a request.\"",
    "\n# Votos y recompensas:",
    "1. Se ha buffeado el comando !daily para que entregue 500 coins en vez de 250.",
    "2. Se agregó una nueva lootbox, Loyalbox.",
    "Contenido: 100-700 de escencia, x1 Rareaxe, x1 Emperium (10%).",
    "Puedes recibir esta cajita votando por Nekotina (!vote) y luego utilizando el comando !daily",
    "\n# Mine:",
    "1. Se actualizó la descripción del comando con ejemplos de como utilizar las diferentes Pickaxes.",
    "2. Se agregó un mensaje tip al intentar utilizar cualquiera de las Pickaxes con el comando !use",
    "\n# Misceláneo:",
    "1. Todos los comandos han sido bloqueados a uso exclusivo de servidores.",
    "2. Optimización de cache, esto debería mejorar los tiempos de respuesta."
  ],
  "1.1.0": [
    "# Reproducción de música:",
    "El módulo de música ha sido recreado completamente. Esto debería solucionar los constantes problemas de conexión e interrupción del servicio. Además, la bot ya no se desconecta del canal cuando la última canción ha terminado.",
    "\nAlgunos comandos fueron removidos porque estaban demás.",
    "El comando loop ha sido desactivado temporalmente.",
    "\n# Economía:",
    "1. Se ha reducido drásticamente el tiempo de espera de los comandos work y steal.",
    "2. Nuevos items y buffos.",
    "3. Se añadió un monto mínimo para slots (25 coins).",
    "4. Todos los items han sido traducidos a español.",
    "\n# Fish:",
    "Nuevo sistema de pesca con mecánicas similares a la minería.",
    "Si tienes suerte, puedes toparte con un Pez tropical Shiny, el nuevo buff que duplica la experiencia obtenida durante 12 horas.",
    "\n# Minería:",
    "Ahora cuenta con niveles y para cada uno se necesita de una ⛏️ específica.",
    "En todos los niveles puedes toparte con un Emperium. Aumenta la probabilidad según el nivel.",
    "\n# General:",
    "1. Se mejoraron varias descripciones del comando help.",
    "2. El comando  say ahora tiene 5 segundos de cooldown para evitar abusos.",
    "3. Se rescribieron varias respuestas de la bot para que sean menos verbosas.",
    "\n# Corrección de bugs:",
    "1. El comando unsub mostraba un mensaje de error si no se ingresaba un evento.",
    "2. Algunas canciones de Listen.moe no contienen álbum y provocaban un error en el comando nowplaying."
  ],
  "1.1.1": [
    "# Música:",
    "Se ha restablecido el nodo de música de Nekotina (youtube la había baneado).",
    "Las canciones vuelven a sonar.",
    "\n# Nuevo comando:",
    "Se añadio el comando sell, ahora puedes vender los items acumulados en tu inventario.",
    "\n# Loot boxes:",
    "Las loot boxes han sido deshabilitadas temporalmente hasta arreglar todos los bugs detectados."
  ],
  "1.1.2": [
    "# Economía:",
    "1. ¡Nuevas zonas descubiertas para ir de pesca!",
    "2. Nuevo comando para ver el top 10 de usuarios más ricos de tu servidor",
    "3. Se disminuyó en gran medida las recompensas de los comandos: work, crime y mine.",
    "\n# Social:",
    "1. El comando leaderboard ha sido renombrado a lbgl (leaderboard global).",
    "2. Nuevo comando para ver el top 10 de usuarios con más experiencia de tu servidor.",
    "\n# Roleplay:",
    "1. Nuevos comandos de interacción: gaming y cook",
    "\n# Corrección de bugs:",
    "1. Algunos usuarios recibían un error de que ya estaban casados con la persona a la cuál intentaban proponer matrimonio."
  ],
  "1.2.0": [
    "# Nekos:",
    "Los nekos son el nuevo sistema de logros y recompensas de Nekotina.",
    "Estos aparecerán en tu perfil cuando desbloquees al menos 1.\n",
    "1. Hoshi: Desbloqueable usando los comandos de anime",
    "2. Dume: Desbloqueable usando los comandos de reacción.",
    "3. Mata: Desbloqueable usando los comandos de interacción.",
    "4. Neko Siamés: Disponible en la tienda.",
    "5. Luna: Disponible en la tienda.",
    "6. Meow: Disponible en la tienda.",
    "\n# Economía:",
    "1. Nueva moneda.",
    "2. Se aumentó la dificultad para ganar coins.",
    "3. Se aumentó el precio de varios items en la tienda.",
    "4. Nuevos items en la tienda.",
    "\n# Roleplay:",
    "El comando cake ha sido removido como tal y ahora es utilizable a través del pastel en la tienda.",
    "\n# Ship:",
    "Se cambió la categoría del comando a anime."
  ],
  "1.2.1": [
    "# Economía: (Here we go again...)",
    "1. Nuevo item en la tienda.",
    "2. Nuevos stats para mostrar en el perfil.",
    "3. Los leaderboard han sido re-trabajados y están de vuelta.",
    "4. El comando mine ahora tiene una pequeña probabilidad de causar la muerte.",
    "\nMuerte: El morir significa perder todas las coins que no estén a salvo en el banco.",
    "\n# Corrección de errores:",
    "1. Los comandos lock y unlock ahora funcionan correctamente.",
    "2. Ahora Autolewd solicita correctamente el permiso Manage Webhooks.",
    "3. Autolewd ha sido bloqueado por completo a canales NSFW. Si se desactiva el NSFW en dicho canal, será necesario re-configurar Autolewd nuevamente."
  ],
  "1.3.0": [
    "# Economía EP.2",
    "1. Nuevo sistema de mascotas.",
    "2. Nuevo sistema de crafteo.",
    "3. Nuevo sistema de zonas.",
    "4. Nuevo sistema de exploración.",
    "5. Dos nuevas minas y una nueva zona de pesca.",
    "6. Nuevo sistema de notificaciones.",
    "\n# Corrección de errores durante la versión 1.2.1",
    "1. Ya no es posible interactuar con bots mediante los comandos de economía.",
    "2. Ya no aparece una categoría 'undefined' en el comando help.",
    "3. Las minas explosivas vuelven a funcionar.",
    "4. Los perfiles vuelven a cargar con normalidad."
  ],
  "1.3.1": [
    "# Youtube ratelimit",
    "Se implementó una solución automatizada para los bloqueos de youtube. El servicio de música no debería volver a interrumpirse.",
    "\n# Craft",
    "Se cambiaron los materiales de la Poción de Regeneración para que puedan crearse solo explorando la primera zona con las mascotas (bosque)."
  ],
  "1.3.2": [
    "# Nuevo comando",
    "El comando iteminfo ha sido añadido. Con este comando podrás ver la información de cualquier item.",
    "\n# Corrección de errores:",
    "1. Seitengrat y Zodiac ahora son utilizables y el 0% de probabilidad de romperse ha sido aplicado.",
    "2. Se corrigió la información proporcionada por el comando !pet zones",
    "3. La bot ahora responde con un mensaje si se ingresa una zona no existente en los comandos !mine y !fish"
  ],
  "1.3.3": [
    "# Economía",
    "1. Una guía ha sido agregada al módulo de economía. Puedes revisarla con !guide",
    "2. Ahora es posible interactuar (comprar, vender, regalar, usar, etc) con items a través de su ID.",
    "3. La mochila ahora muestra el ID de cada item.",
    "\n# Corrección de errores:",
    "1. Ya no es posible ingresar números decimales en los comandos !share, !deposit y !withdraw"
  ],
  "1.3.4": [
    "# Nuevo comando",
    "Se agregó el comando !pet info, el cual muestra el gif y la información de cualquier mascota existente.",
    "\n# Corrección de errores:",
    "1. Ya no aparece un error \"ParallelSaveError\" al utilizar algunos comandos de economía.",
    "2. Los items \"Anvil de Oro\" y \"Mortero Dorado\" ahora se pueden craftear.",
    "3. La categoría config del comando !help ahora se muestra correctamente.",
    "4. La variable {{members}} de los mensajes de bienvenida y despedida ya no aparece como undefined."
  ],
  "1.3.5": [
    "# Time Crash",
    "Ahora es posible revertir los robos recibidos.",
    "Condiciones:",
    "- El ladrón aún no ha gastado el botín.",
    "- El robo ocurrió hace menos de 20 minutos.",
    "- El robo ocurrió en el mismo servidor en donde se utiliza el Time Crash",
    "\n# Minas explosivas",
    "1. Se redujo el precio a 5000 coins.",
    "2. Las minas ahora tienen una duración de 4 horas plantadas.",
    "\n# Slots:",
    "El monto máximo de apuesta ahora son 5000 coins",
    "\n# Medidas anti-abusos",
    "1. Abandonar un servidor justo después de perpetrar un robo activa el Time Crash de forma automática. (El botín regresa al dueño original y el ladrón lo pierde).\n",
    "2. Todos los usuarios ahora tienen un límite de cuantas coins pueden recibir a través del comando !share. Este límite aumenta según el uso que le den a la bot.",
    "\n# Divorcios",
    "Ahora es posible divorciarse escribiendo el nombre del usuario (sin mención).",
    "\n# Corrección de bugs",
    "1. El buscador ahora diferencia mascotas con nombre similar.",
    "2. El comando !pet disown ahora si libera a la mascota.",
    "3. El comando !clubinfo ya no responde con error si uno de los integrantes del club no está en el servidor.",
    "4. El comando !kill ya no muestra un comando que no existe."
  ],
  "1.3.6": [
    "# Cambios",
    "1. Ahora puedes elegir entre enviar mensajes de bienvenida en texto plano o embeds.",
    "2. Se añadió la opción de cancelar la exploración en curso con !pet explore cancel",
    "3. Se ha refinado el buscador interno de Nekotina para que pueda encontrar items y mascotas de forma más precisa.",
    "4. Ahora recibes una notificación por mensaje privado si desbloqueas un neko (logro).",
    "\n# Corrección de errores",
    "El tiempo de descanso post exploración ahora se aplica correctamente sobre las mascotas."
  ],
  "1.3.7": [
    "# Nuevos comandos",
    "1. La auto asignación de roles mediante reacciones ha llegado. Puedes iniciar la configuración con !selfroles",
    "2. Ahora puedes ver todas las mascotas existentes a través del comando !pet list"
  ],
  "1.3.8": [
    "# Cambios al sistema de economía",
    "1. Las picas Rareaxe, Spectral y Rainbow fueron removidas de la tienda para pasar al sistema de crafteo.",
    "2. Las cañas Reforzada, Irenes y Zelbess fueron removidas de la tienda para pasar al sistema de crafteo.",
    "3. Todas las pets han recibido cambios a sus stats base.",
    "4. Nuevas zonas de exploración: Montes Mosfora y Ciudad Invadida.",
    "5. La penalización de abandono de las mascotas ha sido removida.",
    "6. Ahora es posible tener hasta 3 mascotas.",
    "7. Las picas y cañas ya no se rompen aleatoriamente. Ahora se aplica una fórmula de durabilidad.",
    "8. Nuevos items de crafteo.",
    "9. Nuevos items en la tienda.",
    "10. Nuevos nekos",
    "11. Se actualizaron las recompensas de varias zonas de minería y pesca."
  ],
  "1.3.9": [
    "1. Se mejoró la información que muestra el comando !iteminfo",
    "2. El comando !craft ahora muestra los materiales requeridos en la lista de items creables.",
    "3. Ahora puedes cambiar el nombre del club si eres el fundador o un administrador.",
    "4. El leaderboard de pats ahora muestra el top 10 completo."
  ],
  "1.3.9b": [
    "1. El comando !pet disown ya no elimina mascotas al azar.",
    "2. Cambiar de mascota activa ya no resetea el tiempo de espera de recuperación.",
    "3. Ahora se muestran los materiales faltantes al intentar crear un item."
  ],
  "2.0.0": [
    "# Contenido nuevo",
    "1. Nuevas zonas de pesca, minería y exploración.",
    "2. Nuevos items para la tienda y crafteo",
    "3. Se incrementó la cantidad de coins entregadas por los comandos !work y !crime",
    "4. Se disminuyó la penalización en coins del comando !crime.",
    "5. Se aplicó un re-balanceo de mascotas acorde a la rareza del huevo (tier).",
    "\n# Corrección de errores",
    "1. Se corrigió un error en el comando !bugreport, el cuál impedía enviar el reporte.",
    "2. La fecha de registro ya aparece en los perfiles nuevamente",
    "3. Los buffs que se muestran en la mochila ahora concuerdan con el miembro mencionado.",
    "4. Se corrigieron varios errores de ortografía en diversos comandos.",
    "\n# Cambios detrás de escena",
    "1. Se implementó un nuevo sistema de caché corriendo bajo Redis.",
    "2. El nodo de música fue transladado a su própio servidor.",
    "3. Se ha puesto en marcha un sistema automatizado que corrigirá e impedirá que vuelvan a ocurrir los siguientes problemas:",
    "- Perfiles dañados (nekos duplicados).",
    "- Cooldowns dañados que impiden la utilización de buffos a algunos usuarios."
  ],
  "2.0.1": [
    "# Costo de creación",
    "Se disminuyó el costo de creación de los siguientes items:",
    "- Piedra del Dragón de Fuego (50,000 -> 8,000).",
    "- Piedra del Dragón de Hielo (50,000 -> 8,000).",
    "- Talismán de Dragón (75,000 -> 10,000).",
    "- Pendiente de Scala (80,000 -> 12,500).",
    "- Varita Mágica (90,000 -> 25,000).",
    "\n# Megalodón y Derrumbes",
    "- Las probabilidades de muerte ahora se muestran en la información de cada zona.",
    "- Se disminuyó un poco el porcentaje de muerte en las zonas de pesca y minería.",
    "\n# Corrección de errores",
    "El comando !clubapps ya no responde con error si uno de los aplicantes no se encuentra en el shard del servidor."
  ],
  "2.0.2": [
    "# Contenido para patreons y nitro boosters",
    "Nuevos comandos: !claim y !weekly",
    "Nueva zona de minería: Meteora",
    "Nuevos items: Galaxy, Anvil Galáctico, Cajitas Premium, Platino y Diamante",
    "Nuevos materiales: Mineral Espacial, Gran Roca Espacial y Barra Espacial",
    "\n# Nuevas mascotas",
    "- Hillslion, Doram y Eleanor",
    "\n# Cambios",
    "Se redujo el cooldown del comando !steal (5 -> 2 minutos)."
  ],
  "2.0.3": [
    "# Crime",
    "1. El comando ha sido re-creado.",
    "2. Nuevo cooldown: 30 segundos",
    "3. ¡Cuidado! Ahora puede causar la muerte.",
    "\n# Loots",
    "Se aumentó el tiempo de espera (15 -> 20 segundos).",
    "\n# Corrección de errores",
    "Las loots box ya no desaparecen instantáneamente."
  ],
  "2.0.4": [
    "# Mochila",
    "Los buffos ahora muestran el tiempo restante.",
    "\n# Nuevo item",
    "Blanco y Negro pintará tu perfil a uno de los dos colores.",
    "\n# Cambios a los cofres/loots/premium",
    "1. Se incrementó la cantidad de coins recibidas al abrir los cofres.",
    "2. Se modificaron todas las tablas de drops.",
    "3. La Cajita Mágica ahora requiere de una Llave.",
    "\n# Comando steal",
    "1. Se redujo el margen de utilización del Time Crash (20 -> 5 minutos).",
    "2. Después de ser víctima de un robo, el usuario queda inmune al comando steal por 2 minutos.",
    "\n# Corrección de errores",
    "Se corrigieron varios errores ortográficos en algunas de las respuestas de la bot."
  ],
  "2.0.5": [
    "# Ángel Guardían",
    "El buff ahora impide que se active la muerte en los comandos !crime y !steal.",
    "\n# Servershop",
    "1. El subcomando !add pasó a llamarse !additem",
    "2. El subcomando !remove pasó a llamarse !removeitem",
    "3. El comando !crime ha sido re-integrado a la economía por servidor.",
    "\n# Corrección de errores",
    "La fecha de registro no se estaba mostrando en los perfiles."
  ],
  "2.0.6": [
    "# Cambios a items",
    "1. El precio de Gusanito fue reducido a 7.500 coins",
    "2. El precio de Linterna fue reducido a 7.500 coins",
    "3. Se agregó más detalle a las descripciones de los items que otorgan buffs y se corrigieron otras que estaban mal.",
    "\n# Cambios a zonas",
    "1. Los buffs de drops ahora no afectan la tabla Raros en la pesca y Tesoros en la minería, pero aumentan la cantidad de items (x cantidad) que puedes recibir en las demás tablas.",
    "\n# Comandos",
    "1. El comando !clubinfo ahora muestra la experiencia que ha donado cada integrante."
  ],
  "2.0.7": [
    "# Matrimonios",
    "1. Se corrigió un error en el comando !marry que permitía casarse con el mismo usuario múltiples veces.",
    "2. Para corregir dicho error, se han reseteado todas las propuestas de matrimonios pendientes.",
    "3 Los perfiles recibieron una actualización visual para los usuarios con más de 5 matrimonios.",
    "\n# Economía",
    "1. El item Expansión de Banco ahora aumenta la capacidad bancaria de forma aleatoria entre 1.000 a 10.000."
  ],
  "2.0.8": [
    "# Matrimonios",
    "1. El comando !marry ya no responde con una propuesta pendiente fantasma.",
    "\n# Economía",
    "1. Se aumento la probabilidad de encontrar una Barra de mineral en la mina Penumbra (15% -> 30%).",
    "2. Se disminuyó la probabilidad de encontrar una Barra de acero en la mina Umbra (25% -> 15%)."
  ],
  "2.0.9": [
    "# Perfiles Globales",
    "Ahora puedes mirar el perfil de cualquier usuario de los leaderboards aunque no sea miembro del servidor.",
    "\n# Clubs",
    "Se corrigió un error que impedía ver la lista de integrantes y miembros baneados en algunos clubs."
  ],
  "2.0.10": [
    "# Comandos",
    "1. Se mejoró el tiempo de respuesta del comando !profile y ya no responde con error si el usuario dejó de existir en discord o no comparte un servidor con la bot.",
    "2. El comando !say ya no requiere del permiso \"Mention Everyone\" y se le añadieron nuevas opciones: --embed y --voting."
  ],
  "2.1.0": [
    "# Moderación",
    "1. Se agregó más detalle a los registros/logs de moderación y se mejoraron visualmente.",
    "2. Se agregaron nuevos logs para los comandos !mute y !unmute, además de la opción de agregar un motivo",
    "3. Ahora es posible desbanear ingresando un usuario o id.",
    "\n# Corrección de errores",
    "1. El establecer un log en un nuevo canal de texto, ya no resetea toda la configuración de logs en los demás canales previamente configurados.",
    "2. Autorole ya no retorna con error si falla al intentar asignar un rol."
  ],
  "2.1.1": [
    "# Blacklist",
    "1. El comando a sido dividido en dos: !blacklist y !unblacklist",
    "2. Los nuevos comandos son capaces de encontrar al usuario aunque éste haya huido del servidor de soporte.",
    "3. Ahora las prohibiciones y liberaciones se propagan correctamente en todos los shards.",
    "\n# Prefix",
    "1. El comando a sido dividido en dos: !setprefix y !prefix",
    "\n# Corrección de errores",
    "1. Se retrabajaron varios sistemas en busca de solucionar múltiples errores internos."
  ],
  "2.1.2": [
    "# Configuración",
    "1. Se limitó el prefix configurable a máximo 5 caracteres.",
    "\n# Economía",
    "1. Los avisos de muerte o gasto de vida extra ahora mencionan al usuario.",
    "2. Se incrementó la cantidad máxima de apuesta de la máquina de slots (5,000 -> 10,000).",
    "\n# Corrección de errores",
    "1. El comando !proposals ya no responde con error al intentar mostrar una excesiva cantidad de propuestas pendientes.",
    "2. Se corrigieron varias descripciones de items.",
    "3. Se corrigió la descripción de ayuda del comando !levelup",
    "4. Se solucionó un error de gravedad en el caché de redis que provocaba un crash inminente en la bot."
  ],
  "2.1.3": [
    "# Share y gift",
    "1. El cooldown de ambos comandos se incrementó a 20 segundos y ahora es global.",
    "2. El mensaje de confirmación fue removido por completo.",
    "\n# Cooldowns de economía",
    "1. El cooldown general de Nekotina ya no afecta a los comandos: !share, !gift, !work, !crime, !mine y !fish.",
    "\n# Corrección de errores",
    "1. Se corrigió un error de gravedad que permitía duplicar items de forma infinita a través del comando !gift"
  ],
  "2.1.4": [
    "# Cooldowns de economía",
    "1. La activación de los tiempos de espera de los comandos de economía fueron mejorados.",
    "2. El cooldown general de Nekotina vuelve a afectar a los comandos: !share, !gift, !work, !crime, !mine y !fish.",
    "\n# Loots box",
    "1. Los mensajes ya no activan la posible aparición de una Loot box.",
    "2. Los comandos de economía tienen una pequeña probabilidad de activar una Loot box.",
    "3. El comando de configuración !loots ha sido removido.",
    "\n# Corrección de errores",
    "1. El spam masivo de algunos comandos de economía ya no entrega doble o hasta triple recompensa."
  ],
  "2.2.0": [
    "# Matrimonios",
    "1. Se removieron las funciones de aceptar y rechazar propuestas al comando !marry.",
    "2. Se agregaron dos comandos nuevos: !acceptmarriage y !declinemarriage.",
    "3. Ahora es posible rechazar propuestas de miembros que han abandonado el servidor.",
    "\n# Perfiles",
    "1. Ya no es posible buscar perfiles mediante el tag si el usuario no se encuentra en el mismo shard.",
    "2. La búsqueda por ID sigue siendo global (todos los shards) y se mejoró su tiempo de respuesta.",
    "\n# Corrección de errores",
    "1. Habilitar un comando o categoría al rol @everyone ya no imposibilita bloquear a un usuario mediante el disabler.",
    "2. Ya no es posible jugar con la mascota si aún no termina su periodo de incubación.",
    "3. El Huevo de Pitaya ya no responde con error al intentar incubarlo.",
    "4. El color del Huevo de Frus en la zona Khaled ya no figura amarillo."
  ],
  "2.2.1": [
    "# Corrección de errores",
    "1. Se corrigió la descripción de ayuda de múltiples comandos.",
    "2. El comando !clubapps ahora solicita correctamente el permiso de administrador de clubs.",
    "3. El comando !clublevel ya no permite ingresar un nivel por debajo de 3.",
    "4. El comando !marry ahora muestra correctamente a quién se le debe aceptar o rechazar la propuesta de matrimonio.",
    "5. Los comandos !acceptmarriage y !declinemarriage ya no responden con error si el ID ingresado no concuerda con ningún usuario de discord."
  ],
  "2.3.0": [
    "# Música",
    "1. El módulo ha sido retrabajado en su totalidad.",
    "2. La bot ahora se desconecta automáticamente cuando termina la última canción de la lista.",
    "3. Nuevo comando para repetir indefinidamente una canción: !loop",
    "\n# Corrección de errores",
    "1. Ahora la bot es capaz de ejecutar un divorcio si uno de los usuarios ha cambiado su tag."
  ],
  "2.3.1": [
    "# Matrimonios",
    "1. El módulo de matrimonios ha recibido una inyección de gifs.",
    "\n# Corrección de errores",
    "1. Permitir comandos a nivel de servidor ya no sobrescribe ni impide la deshabilitación por canales/miembros/roles..",
    "2. Minar y pescar al mismo tiempo ya no anula el cooldown de uno de los dos comandos."
  ],
  "2.4.0": [
    "# Clubs",
    "1. Nuevo comando para rechazar postulaciones: !clubreject",
    "2. Los comandos !clubkick y !clubban ahora envían una notificación al afectado.",
    "3. El disband de un club requiere de la previa expulsión de todos sus integrantes.",
    "\n# Corrección de errores",
    "1. Ya no es posible expulsar ni banear al líder del club.",
    "2. El líder del club ya no puede auto asignarse el rol de administrador.",
    "3. El proceso de abandonar un club y unirse a otro ya no puede ocasionar que el miembro aparezca en ambos clubs."
  ],
  "2.4.1": [
    "# Votos",
    "1. El comando !vote ahora muestra información sobre las recompensas y el tiempo de espera faltante para tu próximo voto.",
    "\n# Economía",
    "1. La información del comando !guide ha sido actualizada.",
    "2. Se mejoró el tiempo de respuesta y la precisión del comando !profile. Además la búsqueda por usuario/tag vuelve a ser global.",
    "\n# Corrección de errores",
    "1. La experiencia, nivel y rank de los clubs ahora se muestran correctamente.",
    "2. Ahora al morir, el buff del gusanito se remueve al igual que los demás.",
    "3. Ya no es posible sancionar mediante la bot a miembros con rol superior al tuyo."
  ],
  "2.4.2": [
    "# Torre de Babel",
    "1. El requerimiento para abrir la torre aumentó en gran cantidad.",
    "2. Las recompensas de Babel: Bolsa Mágica, Rocas Mágicas, Gema Mágica y Cajita Mágica ya no pueden regalarse.",
    "3. Las herramientas especiales: Varita Mágica y Ensueño ya no pueden regalarse."
  ],
  "2.4.3": [
    "# Economía",
    "1. Se reajustó la ganancia de coins en las zonas de minería y pesca",
    "2. Las herramientas especiales sólo caen al utilizar herramientas comunes (minar con zodiac ya no da zodiac, pescar con seitengrat ya no da seitengrat).",
    "3. Se añadieron los items Red de Pescar y Materiales para potenciar las recompensas de las primeras zonas.",
    "4. Se modificó el contenido de los items Tesoros y Cajas Marinas",
    "\n# Utilidades",
    "1. Nuevo comando: !afk. Cuando alguien te mencione, la bot le avisará que te encuentras AFK junto al motivo que has configurado.",
    "\n# Corrección de errores",
    "1. La bot ya no se reinicia debido a un problema con el ShardManager."
  ],
  "2.4.4": [
    "# Mascotas",
    "1. Los subcomandos de pet ahora sólo muestran la información de tu mascota activa, no la de los demás.",
    "2. Ahora puedes revisar información sobre mascotas de otros miembros a través de la Nekodex.",
    "\n# Optimizaciones",
    "1. Los cooldowns ahora son controlados en memoria y no en la base de datos."
  ],
  "2.4.5": [
    "# Corrección de errores",
    "1. El neko Mata ahora aparece en el perfil luego de desbloquearlo.",
    "2. Las mascotas en reposo ya no muestran sus barras de estado.",
    "3. Debido a un abuso del comando !afk, este ya no modifica el nickname del usuario.",
    "4 Ya no es posible mencionar miembros, roles o canales a través de los comandos !afk y !say"
  ],
  "2.5.0": [
    "# Clubs",
    "1. Nuevos comandos: !clubskills, !clubdep, !clubwd.",
    "2. Se implementó el sistema de habilidades de clubs.",
    "3. Se implementó el banco de clubs.",
    "\n# Economía",
    "1. Nueva zona de minería con mascotas e items nuevos: Mura.",
    "2. Nueva zona de exploración con mascota nueva: Jardín de Baphomet.",
    "3. Se incrementó la recompensa en coins de la mina Inferno.",
    "4. Se disminuyó el bonus de experiencia del Pez Shiny (100% -> 50%).",
    "5. Se disminuyó el bonus de experiencia del Durazno (100% -> 50%).",
    "6. Se mejoró la información mostrada por el comando !iteminfo.",
    "7. Se mejoraron las estadísticas de Thanatos, Eleanor y Cat o' Nine Tails.",
    "8. Emperium ha sido eliminado de la tienda.",
    "\n# Optimización",
    "1. Se reconstruyó el cómo trabajan los comandos !pet zones y !pet explore.",
    "\n# Corrección de errores",
    "1. La información de los perfiles ahora se guarda correctamente en el cache."
  ],
  "2.5.1": [
    "# Economía",
    "1. Ya no es posible regalar coins luego de un robo si la víctima aún está a tiempo de revertirlo.",
    "2. Los nuevos usuarios de la bot deberán esperar 3 días para poder recibir regalos de items y coins.",
    "3. El comando !share ya no aumenta el límite de transferencia ni la capacidad bancaria.",
    "\n# Optimización",
    "1. Se hicieron varias optimizaciones al momento de actualizar información en la base de datos.",
    "\n# Corrección de errores",
    "1. Se corrigieron varios exploits en el módulo de economía."
  ],
  "2.5.2": [
    "# Economía",
    "1. El item Time Crash ahora puede revertir robos a nivel global. (Si el robo se cometió en el servidor A, Time crash puede revertirlo en el servidor B.",
    "2. La bot ya no devuelve las coins si el ladrón huye del servidor. (Redundante por el buff al time crash).",
    "# Optimización",
    "1. Se hicieron más mejoras al momento de actualizar información en la base de datos.",
    "\n# Corrección de errores",
    "1. Ya no es posible mencionar de ninguna forma a través de los comandos !say y !afk."
  ],
  "2.5.3": [
    "# Confesiones",
    "Se añadió la nueva funcionalidad de enviar y recibir confesiones.",
    "1. Nuevo comando de configuración: !setconfessionsch",
    "2. Nuevo comando de diversión: !confession",
    "\n# Mochila",
    "Ahora es posible ordenar tu mochila. Consulta !help bag para más detalles.",
    "\n# Corrección de errores",
    "1. El comando !afk ya no requiere del permiso Gestionar Apodos."
  ],
  "2.6.0": [
    "# Mejoras en el sistema de subcomandos",
    "1. El comando !help ahora puede mostrar ayuda sobre los subcomandos de mascotas. Se debe invocar el !help con el formato 'pet-subcomando'. (Ejemplo: Para ver ayuda sobre pet explore, escribe !help pet-explore)",
    "2. Ahora es posible desactivar subcomandos de mascotas a través de !disable. (Ejemplo: !disable pet-feed)",
    "3. Los subcomandos de mascotas ahora tienen cooldowns independientes.",
    "\n# Mejoras internas en Nekotina",
    "1. El consumo de memoria ram ha sido reducido un 50%",
    "2. El sistema de registros (logs) para cazar a los maleantes ha sido mejorado.",
    "3. El sistema de subcomandos ha sido reescrito por completo para darles una mayor independencia y flexibilidad.",
    "\n# Corrección de errores",
    "1. Se detectó la causa del reinicio inesperado de algunos shards y se implementó una solución de pruebas."
  ],
  "2.6.1": [
    "# Modo pasivo",
    "Una nueva funcionalidad ha llegado: El modo pasivo.",
    "Para activarlo o desactivarlo debes utilizar el comando !settings pasivo.",
    "1. Se debe esperar 24 horas entre cada vez que se activa o desactiva.",
    "2. El modo pasivo te hace invulnerable a los robos.",
    "3. No puedes robar si el modo pasivo está activo",
    "4. No puedes enviar ni recibir coins si el modo pasivo está activo",
    "5. No puedes enviar ni recibir items si el modo pasivo está activo.",
    "\n# Servershop",
    "Continuando con la mejora a los subcomandos, tenemos novedades para la tienda de servidor.",
    "1. El comando !help ahora puede mostrar ayuda sobre los subcomandos de servershop. Se debe invocar el !help con el formato 'ss-subcomando'. (Ejemplo: Para ver ayuda sobre ss buy, escribe !help ss-buy).",
    "2. Ahora es posible desactivar subcomandos de servershop a través de !disable. (Ejemplo: !disable ss-slots).",
    "3. Los subcomandos de servershop ahora tienen cooldowns independientes.",
    "4. El comando !ss add ha sido renombrado a !ss addrole.",
    "5. El comando !ss remove ha sido renombrado a !ss removerole.",
    "6. El comando !ss update ha sido renombrado a !ss updaterole."
  ],
  "2.6.2": [
    "# Economía",
    "1. Los items Seitengrat y Zodiac ya no son herramientas empleables en fish y mine",
    "2. Los buffs de drop vuelven a afectar a los tesoros y raros.",
    "3. El cooldown del modo pasivo ha sido reducido a 12 horas.",
    "4. El costo de apertura de babel ha sido reducido un 40%.",
    "\n# Corrección de errores",
    "1. Ya no es posible banear ni expulsar a miembros que no pertenecen a tu club."
  ],
  "2.7.0": [
    "# Comandos restaurados",
    "1. Todos los comandos dependientes de las reacciones han sido restaurados y adaptados al nuevo sistema de paginación.",
    "\n# Tienda de servidor (servershop)",
    "La nueva tienda por servidor ya está aquí con grandes mejoras.",
    "Para iniciar el menú de configuración, deben escribir !ss enable y luego !ss additem.",
    "1. Los roles han sido convertidos en items personalizables y añadibles a la tienda.",
    "2. El comando !ss addrole ha sido reemplazado por !ss additem.",
    "3. El comando !ss removerole ha sido reemplazado por !ss removeitem.",
    "4. El comando !ss updaterole role ha sido reemplazado por !ss updateitem.",
    "5. Nuevo comando para ver la información del item personalizado: !ss iteminfo.",
    "\n# Corrección de errores",
    "1. El item Haste vuelve a afectar al comando !crime."
  ],
  "2.7.1": [
    "# Lista de cambios",
    "1. Se mejoró la precisión del comando !ss buy al buscar un item para comprar.",
    "2. El comando !say ha sido reactivado.",
    "3. Se mejoró visualmente la lista de comandos desactivados aprovechando el nuevo sistema de paginación (!disable --list).",
    "\n# Corrección de errores",
    "1. Se detectaron y parchearon múltiples formas de hacer que la bot mencione de forma no deseada.",
    "2. Algunas respuestas ocasionaban que el comando ss additem respondiera con error. Esto ha sido solucionado."
  ],
  "2.7.2": [
    "# Comandos",
    "1. Se añadió un nuevo comando para realizar operaciones matemáticas: !math",
    "2. Se añadio un nuevo comando para seleccionar a un miembro aleatorio del servidor: !random",
    "\n# Economía",
    "1. Las mascotas personalizadas han sido desplegadas a sus dueños.",
    "2. Las loot box han recibo una inyección de items.",
    "\n# Optimizaciones",
    "1. Estando la bot más estable, se volvió a implementar el sistema de clusters para reducir el consumo de memoria."
  ],
  "2.7.3": [
    "# Mejoras",
    "1. Ahora es posible configurar y mostrar una frase para los perfiles.",
    "2. El comando !pet-disown ahora pide confirmar el abandono de la mascota.",
    "3. La lista de propuestas pendientes ahora es global.",
    "4. Se cambiaron algunos detalles de los mensajes de levelup.",
    "5. Mejora visual al mensaje de recompensas de exploración.",
    "\n# Correción de errores",
    "1. El gif al desbloquear babel ahora se muestra correctamente.",
    "2. Ya no es posible ejecutar de ninguna forma comandos lewd si se está en blacklist.",
    "3. El comando !summoner ya no responde con error y ha sido reactivado."
  ],
  "2.8.0": [
    "# Música",
    "1. El comando !play ahora permite seleccionar que canción escuchar.",
    "2. Nekotina ya no se desconecta al terminar de reproducir la última canción de la lista.",
    "3. Ahora es posible agregar canciones y listas desde spotify.",
    "4. Ahora es posible dejar en loop la playlist completa con el nuevo comando !loopqueue.",
    "\n# Optimizaciones",
    "1. Se re implementó el sistema de clusters.",
    "\n# Corrección de errores",
    "1. Se corrigieron varios errores internos que podrían haber causado los problema de ratelimit.",
    "2. Se corrigieron múltiples bugs al módulo de música.",
    "\n# Erroes detectados por corregir",
    "1. Los nodos de música fallan al intentar agregar playlists desde youtube."
  ],
  "2.9.0": [
    "# Nifelheim",
    "1. Nuevos comandos, items, zonas y quest desbloqueables sólo por octubre",
    "\n# Cambios internos",
    "1. Nekotina ha sido migrada a la librería Eris.",
    "2. El núcleo de la bot ha sido reescrito por completo para adaptarse a la nueva librería.",
    "3. Nuevo sistema de detección de spam de comandos puesto en marcha.",
    "\n# Corrección de errores",
    "1. Se corrigieron múltiples errores ocasionados con el cambio de librería.",
    "2. Se corrigieron múltiples errores ortográficos."
  ],
  "2.9.1": [
    "# Configuración",
    "1. Nekotina ahora puede detectar y eliminar invitaciones de otros servidores.",
    "2. Nuevo comando !invites para activar/desactivar dicho módulo.",
    "Nota: Los administradores son inmunes y las invitaciones del propio servidor son ignoradas.",
    "\n# Utilidades",
    "1. Nuevos comandos: !inviteinfo y !randomcolor",
    "\n# Mejoras",
    "1. Se optimizaron los comandos que utilizan embeds para mostrar información.",
    "2. Se ajustaron algunos parámetros del comando !ship para que no cause un cuello de botella.",
    "3. Se añadieron pequeñas mejoras visuales a la tienda de servidor.",
    "4. El módulo de AFK ahora añade y remueve [AFK] al nick del usuario.",
    "\n# Corrección de errores",
    "1. El estado AFK ahora se remueve con cualquier mensaje del usuario, esto incluye automencionarse."
  ],
  "2.9.2": [
    "# Economía Global",
    "1. Los cooldowns de !mine y !fish fueron incrementados (5 minutos -> 7 minutos con 30 segundos).",
    "2. Las recompensas de !mine y !fish fueron incrementadas acorde al nuevo cooldown.",
    "\n# Tienda de servidor",
    "1. Ahora es posible añadir un banner a la tienda a través del comando ss addbanner.",
    "2. Se añadieron más comandos para administradores de servidores: ss addbank, ss removebank, ss removebanner.",
    "\n# General",
    "1. El cooldown entre comandos ha sido removido.",
    "2. El contador de kiss ha sido removido."
  ],
  "3.0.0": [
    "# Economía",
    "1. Los comandos !mine y !fish fueron eliminados.",
    "2. Nuevo comando para minar y pescar: !farm",
    "3. Nueva funcionalidad para los items Zodiac y Seitengrat.",
    "4. Nuevas zonas de pesca: Ciudad Muerta y Nebula (donadores).",
    "5. Nuevos items con nuevas funcionalidades.",
    "6. Nuevo deseo para las varitas mágicas.",
    "\n# Boosters",
    "1. Las recompensas fueron reajustas al tier 1 de donadores."
  ],
  "3.1.0": [
    "# General",
    "1. Se aumentó el motivo de AFK a 50 caracteres.",
    "# Moderación",
    "1. Se implementó un registro de casos para todos los eventos moderativos.",
    "2. El comando !tempban ha sido removido.",
    "3. Ahora el comando !ban permite ingresar el tiempo con -t al igual que mute.",
    "4. Nuevo comando !case para revisar todos los casos moderativos.",
    "5. Nuevo sistema de warns configurables con sanción automática: !warnings, !warn, !unwarn.",
    "6. Nuevos registros añadidos al comando !suscribe: warn y unwarn",
    "\n# Nekonomia",
    "1. El ganador de las loot boxes ahora se decide aleatoriamente entre quienes escribieron correctamente el mensaje.",
    "2. Los usuarios en blacklist ya no pueden reclamar loot boxes",
    "3. Se cambió el costo de apertura de Babel."
  ],
  "3.2.0": [
    "# Nekonomia",
    "1. Nueva zona de exploración: Phobos",
    "2. Nuevas mascotas",
    "3. Nuevos items y buff para mascotas.",
    "4. Nuevo ranking de calabazas.",
    "\n# Núcleo",
    "1. Se reescribieron todos los módulos bajo un mismo estándar.",
    "2. Se reorganizaron las carpetas del proyecto.",
    "3. Se disminuyó el slowdown por servidor (500ms -> 300ms).",
    "4. Nuevo sistema de cooldown flexible para exploración."
  ],
  "3.2.1": [
    "# Nekonomia",
    "1. El comando !daily ahora se puede utilizar cada 12 horas. Alcanzan a votar y recibir las recompensas 2 veces al día.",
    "2. La zona de exploración Phobos ha sido cerrada.",
    "3. Las apariciones de cajitas regresaron a ser Loot boxes."
  ],
  "3.2.2": [
    "# Corrección de bugs",
    "1. La ejecución de auto-unmute y auto-unban ya no se interrumpe si el servidor en donde se debe remover la sanción no se encuentra en el shard 0.",
    "2. El comando !queue ya no responde con error si la canción no tiene un \"autor\" definido.",
    "3. Se cambiaron varias respuestas de la bot para evitar que muestre links a través del nombre de los items.",
    "4. Se corrigieron las respuestas de los comandos !warn y !unwarn al no ingresar un miembro."
  ],
  "3.2.3": [
    "# Comandos",
    "1. Nuevo comando para añadir roles mediante reacciones (selfrole): !reactionrole <id mensaje> <emoji> <rol>",
    "2. !El comando forceban ahora sólo acepta un ID de usuario como parámetro, pero puede banear incluso si no comparten servidores con la bot.",
    "\n# Corrección de errores",
    "1. Los webhooks de autolewd eliminados mientras Nekotina está offline ya no causan que el comando serverconf responda con error.",
    "2. El comando !summoner ya no hace mención si se ingresa un @ al momento de buscar un invocador."
  ],
  "3.2.4": [
    "# Acciones y reacciones",
    "1. Se añadieron más de 200 gifs nuevos para los comandos de acción y reacción.",
    "2. Se cambió el link de la API de imágenes a https://cdn.nekotina.com/, el antiguo dominio weebs.cl ya no es válido.",
    "3. El comando !sape ahora utiliza nuestra api de imágenes en vez de gifs subidos a un chat de discord.",
    "\n# Nekonomia",
    "1. El uso excesivo del comando !farm nos está dando problemas con discord por lo que aumentamos su cooldown. (5 minutos -> 30 minutos)"
  ],
  "3.2.5": [
    "# Mejoras",
    "1. Se añadieron otros 100 gifs nuevos para los comandos de acción y reacción.",
    "2. El comando !reactionrole ahora permite configurar con los emojis por defecto.",
    "\n# Utilidades",
    "1. Nuevo comando para ver el icono del servidor: !icon",
    "2. Nuevo comando para ver el banner del servidor: !banner",
    "3. Nuevo comando para ver el splash del servidor: !background",
    "4. Nuevo comando para ver el discovery del servidor: !discovery",
    "\n# Core",
    "1. La base de datos ahora registra el tag (usuario#discrimandor) cuando la bot detecta alguna interacción del usuario con discord.",
    "2. Se adaptaron varios métodos (añadir coins, experiencia, etc) para que registren el tag del usuario.",
    "\n# Corrección de Errores",
    "1. El comando !reactionrole ahora detecta los mensajes que no se encuentran en el cache de la bot.",
    "2. Se recuperó el cache inicial de la bot (intents)."
  ],
  "3.2.6": [
    "# Nekonomia",
    "1. Ya no existe un límite por transferencia, pero se les cobra un pequeño impuesto. Revisa el detalle en el servidor de soporte.",
    "2. El nivel requerido para utilizar el comando !share ahora es 16.",
    "3. El costo de apertura de babel se redujo a la mitad.",
    "4. Babel ahora dura 12 horas desbloqueado."
  ],
  "3.2.7": [
    "# Nekonomia",
    "1. Zodiac y Seitengrat ahora tienen cooldowns independientes entre ellas y del comando !farm.",
    "2. Las bolsas mágicas ahora son gifteables.",
    "\n# Core",
    "1. Se hicieron algunas optimizaciones a los métodos que consultan la base de datos para los cooldown."
  ],
  "3.2.8": [
    "# Nekonomia",
    "1. Los comandos !mine y !fish han regresado con un cooldown de 30 minutos.",
    "2. El comando !farm ha sido eliminado.",
    "3. Se incrementó la duración de linterna y gusanito a 3 horas.",
    "4. Se incrementó la duración del haste scroll a 1 hora.",
    "# Corrección de errores",
    "1. El comando !nowplaying ahora no responde con error si la canción no tiene un autor definido.",
    "2. Los perfiles nuevos (nivel 1) ya no empiezan con -100 de experiencia.",
    "3. El cooldown de exploración ya no se resetea a 30 minutos si el efecto de haste pet se termina.",
    "4. Se corrigió el texto que se muestra al incubar una Eris.",
    "5. Se corrigieron los permisos necesarios para ejecutar el comando !case"
  ],
  "3.2.9": [
    "# Comandos",
    "1. Nuevos comandos de acción y reacción: !happy, !eat, !lewd.",
    "2. El comando !autolewd fue renombrado a !autonsfw.",
    "3. La categoría lewd fue renombrada a nsfw.",
    "\n# Nekonomía",
    "1. El item manzana ahora es utilizable y su id fue cambiado a 13.",
    "2. El item time crash fue eliminado temporalmente mientras steal está desactivado.",
    "3. El cooldown para regalar items y coins aumentó a 30 segundos.",
    "4. El modo pasivo ha sido eliminado temporalmente.",
    "\n# Servershop",
    "1. Al salir de un servidor se perderán todas las coins que hayas acumulado ahí, incluyendo las del banco.",
    "2. Al ejecutar el comando !leaderboard server se eliminarán todos los miembros con coins que ya no están en el servidor.",
    "\n# Core",
    "1. Los leaderboard ahora muestran a todos los usuarios sin importar si han interactuado con la bot o no.",
    "2. Los clubs ahora muestran a todos sus integrantes sin importar si han interactuado con la bot o no.",
    "3. Eliminamos los registros de robos ya que por el momento no son necesarios y nos hace más pesada la ejecución de los comandos !gift y !share.",
    "\n# Corrección de errores",
    "1. Se arreglaron algunos textos que se mostraban al utilizar los items que otorgan buffs.",
    "2. Se arreglaron algunas descripciones de items.",
    "3. Se arregló el aviso de nivel requerido para recibir o regalar coins.",
    "4. El comando !cook ahora si muestra los gifs al hacer auto mención."
  ],
  "3.3.0": [
    "1. Todos los comandos se han adaptado al nuevo método de respuesta de discord.",
    "2. Se optimizaron todas las respuestas que envía la bot a los usuarios.",
    "3. Ahora los embeds son generados directamente con objetos en vez de instanciar MessageEmbed().",
    "4. Las categorías y comandos NSFW ya no se muestran en canales para todo público al usar el comando !help.",
    "5. Las categorías y comandos de owner ya no se muestran a través del comando !help.",
    "6. Los comandos !stats y !about se fusionaron y se mejoró el diseño e información que brindan.",
    "7. El comando AFK se mejoró visualmente.",
    "8. Nekotina ahora se desconecta si no queda nadie en el canal de voz.",
    "9. El comando !warn ahora avisa por dm al sancionado."
  ],
  "3.3.1": [
    "# Corrección de errores",
    "1. La bot ahora solicita correctamente el permiso \"Leer el historial de mensajes\" en todos sus comandos.",
    "2. Se añadieron menciones forzadas en los derrumbes o ataques del megalodón.",
    "3. Los comandos !feed y !cuddle ya no responden con error."
  ],
  "3.3.2": [
    "# General",
    "1. Todas las respuestas fueron revertidas al sistema anterior.",
    "\n# Nekonomía",
    "1. El haste scroll regresó a su duración original de 30 minutos.",
    "2. Gusanito y Linterna regresaron a su duración original de 1 hora.",
    "3. Las minas explosivas han sido eliminadas.",
    "4. El steal y todo lo relacionado ha sido eliminado, más información en el servidor de soporte."
  ],
  "3.3.3": [
    "# Husbandos",
    "1. Nuevos comando menú para la categoría anime: !husbando",
    "2. Nuevo subcomando para buscar un husbando: !hb s <nombre>",
    "3. Nuevo subcomando para ver el top de husbandos: !hb top",
    "4. Nuevo subcomando para votar por tu husbando: !hb vote <nombre>",
    "\n# Waifus",
    "1. Nuevos comando menú para la categoría anime: !waifu",
    "2. Nuevo subcomando para buscar una waifu: !wf s <nombre>.",
    "3. Nuevo subcomando para ver el top de waifus: !wf top.",
    "4. Nuevo subcomando para votar por tu waifu: !wf vote <nombre>.",
    "\n# Nekonomía",
    "1. Nuevas cajitas Mystery Box y Mini Mystery.",
    "2. Nueva mascota exclusiva: BlackCat.",
    "3. Se duplicaron las recompensas del comando !daily durante este fin de semana."
  ],
  "3.3.4": [
    "# Nekonomía",
    "1. Ya no es posible recibir más notas del explorador al completar la quest.",
    "2. Al completar la quest de Baphomet, se eliminan todas las notas de explorador de la mochila.",
    "\n# Corrección de errores",
    "1. Las playlist de youtube vuelven a sonar.",
    "2. Las canciones y listas de spotify vuelven a sonar.",
    "3. El mensaje al darse auto pat fue corregido."
  ],
  "3.4.0": [
    "# Nekonomía",
    "1. Nueva zona especial de nyaavidad implementada para !mine.",
    "2. Nueva zona especial de nyaavidad implementada para !fish.",
    "3. Nuevo comando de evento nyaavideño: !xmas.",
    "4. Nuevo sistema de pase nyaavideño implementado, el cuál desbloquea recompensas adicionales.",
    "5. Calendario de adviento: Recompensas diarias han sido añadidas para este diciembre 2020.",
    "6. Nuevo evento activado: Cajita sorpresa de nyaavidad.",
    "7. Se añadieron 10 mascotas nuevas.",
    "8. Se añadieron muchos items nuevos.",
    "\n# Comando exclusivo de evento. ",
    "1. Nuevo comando desbloqueable mediante quest para el módulo de acción: !snowball.",
    "\n# Mejoras.",
    "1. Nekotina ahora soporta eventos rotativos diarios (Automaton).",
    "2. Ya no es necesario escribir el nombre completo de un club para encontrarlo con el comando !clubinfo.",
    "3. Nuevo módulo de quest implementado (actualmente sólo hay 2: baphomet y nyaavidad).",
    "4. Nekotina ya no guarda información sobre mensajes editados (debería bajar el consumo de memoría).",
    "5. Los módulos ahora trabajan con promesas (Promise) y son los comandos los encargados de envíar la respuesta al usuario.",
    "6. La globabilidad ahora se basa en la información de la base de datos en vez del cache incompleto de discord."
  ],
  "4.0.0": [
    "# Nekonomía",
    "1. El comando xmas fue desactivado hasta la próxima nyaavidad.",
    "2. Nuevos items temporales de crafteo: Santa Neko y Token Nyaavideño.",
    "3. Nueva tienda temporal: !nekoshop.",
    "4. Multiples items nuevos disponibles sólo en la tienda temporal.",
    "5. Los items Dulce Navideño, Bastón de Caramelo, Galleta de jengibre, ahora son regalables.",
    "\n# Módulos",
    "1. Todos los módulos de la bot ahora son recargables, activables y desactivables en vivo. (aka: Economía, Matrimonios, Clubs, etc).",
    "2. El nuevo módulo de trabajo ha sido implementado, pero no activado.",
    "3. Las quest fueron separadas en su própio módulo, y ya no dependen de los items.",
    "4. Los cooldowns no se ven afectados cuando se realizan cambios en los buffs.",
    "\n# Core",
    "1. Se generó una nueva estructura para los comandos con auto generación del comando !help.",
    "2. Las configuraciones de servidores ahora se almacenan por un periodo de tiempo predeterminado para liberar memoria.",
    "3. El sistema de shards fue reemplazdo por uno personalizado basado en clusters.",
    "4. Los clusters ahora se comunican por un canal de IPC basado en un servidor local en Veza."
  ],
  "4.0.1": [
    "# Perfiles",
    "1. Para cambiar de página ahora es necesario agregar un -p al comando. Ejemplo: !profile @Neko -p 2",
    "\n# Comandos Lewd/Nsfw",
    "1. Ya no es posible interactuar con la bot al utilizar dichos comandos.",
    "\n# Corrección de errores",
    "1. Donar a babel desde un servidor nuevo  (que nunca haya recibido donaciones antes) ya no ocasiona que los items se pierdan.",
    "2. La configuración de un servidor ya no se mezcla con la de otro (prefix cambiante).",
    "3. La configuración predeterminada es detectada correctamente y ya no ocasiona que muchos de los comandos dependientes (cómo los warns) respondan con error.",
    "4. La bot ya no responde a cualquier mensaje si el prefix del servidor no es una letra o número válido.",
    "5. Los nekos desbloqueados aparecen correctamente en el perfil y ya no responden con error.",
    "6. El comando bag -r ya no responde con error.",
    "7. Las pociones de mascotas ahora muestran el mensaje correctamente y no responden con error.",
    "8. El comando !nowplaying ya no responde con error.",
    "9. Los comandos nsfw dependientes de booru vuelven a encontrar resultados.",
    "10. Los comandos para retirar y depositar coins con el banco de club ahora funcionan correctamente.",
    "11. Ya es posible transferir la propiedad del club.",
    "12. El contador del comando !kiss ahora suma correctamente.",
    "13. Los requerimientos para desbloquear el comando !snowball vuelven a ser 50 items de cada uno.",
    "14. El comando !help ya muestra correctamente las descripciones.",
    "15. Los comandos de waifu y husbando ya muestran la lista y top correctamente.",
    "16. Enviarle dm y reacciones a la bot ya no causa errores internos.",
    "17. Reiniciar un cluster ya no explota a toda la bot.",
    "18. Ya es posible expulsar o banear a miembros de los clubs.",
    "19. Ya es posible aceptar o rechazar solicitudes para unirse a los clubs.",
    "20. Los comandos !clubaccept y !clubreject ya permiten aceptar o rechazar un postulante mediante mención o su ID."
  ],
  "4.0.2": [
    "# Nekonomía",
    "1. El evento de navidad ha sido desactivado.",
    "\n# Core",
    "1. Se implementó un nuevo handler centralizado para el envío de mensajes a discord.",
    "2. Todos los comandos envían mensajes a discord a través del handler centralizado.",
    "3. Se eliminaron las conexiones automáticas a la base de datos, dejando 1 por cluster por defecto (8 en total).",
    "\n# Corrección de errores",
    "1. La bot ya no queda atrapada en un bucle cuando intenta enviar mensajes a un canal que ya no existe."
  ],
  "4.1.0": [
    "# Comandos",
    "1. Nuevo comando para dar reputación a un miembro: !reputation",
    "2. Nuevo comando para cambiar los nicks de miembros: !setnick",
    "3. Nuevo comando para cambiar el color de los roles: !rolecolor",
    "4. Todos los comandos ahora tienen 0.6 segundos de cooldown invisible.",
    "\n# Reputación",
    "Se implementó un nuevo sistema de reputación, el cuál permite dar puntos a un miembro y estos se verán reflejados en el perfil de economía.",
    "1. Obtienes 1 punto para otorgar cada 12 horas.",
    "\n# Mejora a los perfiles",
    "Agregamos algunas cosas a los perfiles de economía.",
    "1. Los perfiles ahora muestran una insignia al lado del nombre dependiendo del tier de donación (boosters equivale a tier 1).",
    "2. Los robos fueron reemplazados por la reputación.",
    "\n# Core",
    "1. La librería que corre por debajo de Neko fue cambiada a un custom fork de eris.",
    "2. Todas las estructuras fueron recreadas desde 0 (commands, arguments, clusters, etc)",
    "3. Todos los managers fueron recreados desde 0 (command manager, item manager, pet manager, etc)",
    "4. Se implementaron nuevos sistemas de cooldowns y slowdowns más flexibles."
  ],
  "4.1.1": [
    "# Reputación",
    "Hemos detectado bastantes abusos con el nuevo sistema por lo que traemos algunas medidas.",
    "1. Las cuentas de discord deben tener más de 1 mes de vida para utilizar el comando !rep.",
    "2. Para recibir y dar reputación se requiere nivel 25.",
    "\n# Corrección de errores",
    "1. Los usuarios en blacklist ya no pueden interactuar con la bot.",
    "2. Los items de tipo poción ya no responden con error.",
    "3. El comando !ss additem ya no responde con error si se ingresa el nombre del item como argumento: !ss additem nombre-item.",
    "4. La bot vuelve a mencionar al perder la vida extra con el comando !crime.",
    "5. La bot vuelve a mencionar al abrir una loot box.",
    "6. El comando !softban ahora si banea.",
    "7. El comando muterole ya no responde con error.",
    "8. Los comandos tipo /slash ya no llenan los logs de la bot de warnings",
    "9. Los comandos !mine y !fish ahora si permiten ver las zonas aunque la actividad esté en cooldown.",
    "10. El cluster manager ya no queda esperando por 30 segundos a que los mensajes por dm se envíen correctamente."
  ],
  "4.2.0": [
    "# Matrimonios v2",
    "1. Nuevo comando de compañeros eternos: !teammate.",
    "2. Nuevo comando para enviar una carta de amor: !letter.",
    "3. Nuevo sistema de arbolito matrimonial: !tree, !tree care, !tree gift",
    "\n# Nueva zona de exploración",
    "1. Nuevos items para cambiar los colores de perfil con tonalidades de amor (colores pasteles).",
    "2. Dos mascotas especiales han llegado: Sakura y Blossom.",
    "\n# Mejoras",
    "1. Ahora es posible volver privada la mochila con el comando !settings mochila (mismo para desactivar), lo cual hace que nadie puede revisarla.",
    "2. Los comandos !slot y !ss slot han recibo una completa renovación visual (los usuarios de android son los que mejor se ven beneficiados).",
    "3. El item Haste Scroll ahora reduce un 50% el cooldown de los comandos !mine, !fish, !work, !crime",
    "4. Los tax para los comandos !share y !cwd fueron disminuidos.",
    "5. El votar por la bot en top.gg da dos cajitas y 1,500 coins durante esta semana.",
    "\n# Core",
    "1. Se añadieron más métricas de monitoreo.",
    "2. Mejor registro cuando se desconectan shards.",
    "\n# Corrección de errores",
    "1. Divine Neko Lover ya no otorga recompensas de tier 3.",
    "2. Los comandos de asignación de roles y mute ya no permiten gestionar a miembros que estén sobre el que ejecuta el comando.",
    "3. El buff de tier de donación ahora se ve correctamente reflejado en los comandos (visualmente había desaparecido).",
    "4. Las sanciones automáticas por macro y spam vuelven a surgir efecto en todos los clusters."
  ],
  "4.2.1": [
    "# Nekonomía",
    "1. El árbol matrimonial ahora tiene probabilidad de dejar caer duraznos (1 a 3) al regarlo con !tree care.",
    "2. Reputación ha sido renombrada a Carisma (el comando sigue siendo el mismo) y se añadió el alias !cari.",
    "\n# Core",
    "1. Neko ahora puede desplegar 16 shards en paralelo.",
    "\n# Corrección de errores",
    "1. El registro de casos ya no aparece como #undefined.",
    "2. Roles mediante reacción ahora otorga los roles a los admin/owner igualmente.",
    "3. El módulo de moderación ahora si revisa los permisos y jerarquías correctamente."
  ],
  "4.2.2": [
    "# Nekonomía",
    "1. Evento de San Valentín activado.",
    "2. Nuevo neko para el perfil añadido.",
    "3. Nuevo evento por servidor: Blossom.",
    "4. Nuevo evento por usuario: Corazón de Neko.",
    "\n# Corrección de errores",
    "1. El comando !autonsfw ahora muestra el embed correctamente si el módulo está activo en el servidor."
  ],
  "4.2.3": [
    "# Nekonomía",
    "1. La zona de exploración Sakura ha sido bloqueada a sólo quienes compartan un árbol matrimonial nivel 30.",
    "2. Las cajitas de 250k han regresado a ser loot boxes.",
    "\n# Moderación",
    "1. Nuevo comando para ver las advertencias acumuladas de un miembro: !warns",
    "2. Nueva sanción añadida: !hardmute",
    "=> Esta nueva función remueve todos los roles de un miembro y luego lo silencia.",
    "=> Se puede añadir como auto sanción al acumular warns.",
    "\n# Comandos",
    "1. El comando !settings fue movido a la categoría currency.",
    "2. Comandos de configuración renombrados:",
    "=> !invites -> !setinvites",
    "=> !muterole -> !setmute",
    "=> !warnings -> !setwarns",
    "\n# Corrección de errores",
    "1. El deshabilitar comandos o categorías para un rol ahora surte efecto.",
    "2. El conteo de casos ahora se enumera correctamente en los registros (!subscribe).",
    "3. Los avisos al DM de un neko desbloqueado ahora se envían correctamente.",
    "4. Los balances ya no muestran números décimales.",
    "5. El IPC ahora sí envía el mensaje de unblacklist a todos los clusters.",
    "6. El IPC ahora sí envía el mensaje para recargar un evento en todos los clusters."
  ],
  "4.2.4": [
    "# Nekonomía",
    "1. La cantidad máxima de miembros por club ha sido limitada a 500.",
    "2. Los clubs con más de 500 miembros dejarán de ganar experiencia hasta que limiten su cantidad a dicha cifra.",
    "\n# Comandos",
    "1. El comando !say ahora requiere por defecto el permiso de Gestionar Mensajes",
    "\n# Core",
    "1. Se removieron todas las propiedades y métodos de eris que la bot no necesita.",
    "2. Se potenció más el uso de redis por sobre el caché de mongo.",
    "\n# Corrección de errores",
    "1. El mensaje al dar un kiss ahora si se muestra correctamente.",
    "2. La bot ya no intenta remover el ban a un miembro que ha sido desbaneado manualmente.",
    "3. La fecha de fundación de un club ahora se registra correctamente."
  ],
  "4.3.0": [
    "# Configuración",
    "1. Ahora es posible editar los embed de bienvenidas y despedidas por completo a través de los subcomandos de !welcome.",
    "2. Nuevo mensaje de agradecimiento automático al recibir mejoras de servidor.",
    "3. Los comandos !sub y !unsub fueron renombrados a !log y !unlog",
    "4. Nuevos registros de moderación:",
    "-> edit: Registra los mensajes editados por los miembros del servidor.",
    "-> delete: Registra los mensajes borrados por los miembros del servidor.",
    "-> bulk: Registra el uso del comando !purge",
    "\n# Gestión y Moderación",
    "1. Los comandos de !ban y !forceban ahora permiten eliminar los mensajes del sancionado (1 a 7 días).",
    "2. El comando !purge ahora permite eliminar 100 mensajes de un usuario en específico.",
    "3. Los comandos !lock y !unlock ahora permiten seleccionar el canal a cerrar. Además con el primero se puede agregar el motivo, el cuál se mostrará en el embed.",
    "\n# Economía",
    "1. Los siguientes comandos ahora tienen un cooldown de 3 segundos: !craft, !buy y !sell",
    "2. El cooldown de !claim ahora es global y se reinicia todos los días a las 6AM GMT-3.",
    "3. El comando !claim tiene probabilidad de dar una cajita extra de evento cuando las loots están disponibles.",
    "4. Ahora es posible establecer un canal y mención para los avisos de babel.",
    "5. Nuevo sistema permanente de mini-jefes: Las mascotas pueden ser atacadas ahora al regresar de una exploración.",
    "6. El tier máximo de mascotas se aumentó a 5 (legendarias).",
    "7. Nuevo evento temporal activado: Caza de huevos.",
    "\n# General",
    "1. Ya no es posible interactuar con usuarios en blacklist a través de los comandos de acción.",
    "2. El autorole no se activa si el miembro aún no acepta la ventana de bienvenida.",
    "\n# Corrección de errores",
    "1. La bot ya no ejecuta los comandos si no tiene el permiso de escribir en el canal.",
    "2. El request handler ya no queda atorado si se agrega un motivo con carácteres raros al momento de sancionar."
  ],
  "4.4.0": [
    "# Resumen",
    "1. Nuevos comandos configurables para moderación personalizada.",
    "2. Nivel de perfiles y clubs reiniciados.",
    "3. Tax fijo de 5% por transacción.",
    "4. Optimizaciones varias a la base de datos."
  ]
}
